prototypage/05_projet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prototypage (rapide)</title>
<meta name="description" content="prototypage rapide" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>




</head>
<body>
<div id="content" class="content">
<h1 class="title">Prototypage (rapide)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org334e037">Consignes relatif au projet</a></li>
<li><a href="#org34f5e05">Contraintes</a></li>
<li><a href="#org134335f">Assemblage fond de boitier et carte Nucleo</a></li>
</ul>
</div>
</div>

<div id="outline-container-org334e037" class="outline-2">
<h2 id="org334e037">Consignes relatif au projet</h2>
<div class="outline-text-2" id="text-org334e037">
<p>
Le projet consiste en la conception, la fabrication et la programmation d'une <i>useless box</i>.
Ce projet implique:
</p>
<ul class="org-ul">
<li>la programmation d'un micro controller</li>
<li>son interfaçage avec un moteur et un switch</li>
<li>la conception des éléments mécaniques et du boitier</li>
</ul>


<p>
<a href="https://youtu.be/rFJcrQHw1k0">https://youtu.be/rFJcrQHw1k0</a>
</p>
</div>
</div>

<div id="outline-container-org34f5e05" class="outline-2">
<h2 id="org34f5e05">Contraintes</h2>
<div class="outline-text-2" id="text-org34f5e05">
<ul class="org-ul">
<li>Boitier: Les visses utilisées pour l'assemblage du boitier sont de type M3</li>
<li>Boitier: Le boitier doit laisser apparent le connecteur USB de la carte mère</li>
<li>Boitier: Le boitier doit faire intervenir dans sa fabrication de l’impression 3D et de la découpe laser</li>
<li>Boitier: La carte mère doit être fixée au fond du boitier (entretoises M3 de longueur 10 mm)</li>
<li>Impression 3D: Les parties imprimées en 3D doivent être auto portantes (pas de support)</li>
<li>Découpe laser :Les parties découpées au laser font 3mm d’épaisseur</li>
</ul>
</div>
</div>




<div id="outline-container-org134335f" class="outline-2">
<h2 id="org134335f">Assemblage fond de boitier et carte Nucleo</h2>
<div class="outline-text-2" id="text-org134335f">
<p>
Vous pouvez vous aider de ce début d'assemblage pour construire le boitier.
Il faut télécharger les 2 fichiers
</p>

<p>
<a href="./3dmodels/fondboitier/FondBoitierNucleo_Entretroise.SLDPRT">./3dmodels/fondboitier/FondBoitierNucleo_Entretroise.SLDPRT</a>
</p>

<p>
<a href="./3dmodels/fondboitier/assemblage.SLDASM">./3dmodels/fondboitier/assemblage.SLDASM</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
